app/Controllers/Filme.php

    public function index($status = null)
    {
        $query = $this->request->getGet('q');
        $builder = $this->filmeModel;

        if ($status) {
            $builder = $builder->where('status', $status);
        }

        if ($query) {
            $builder = $builder->like('filme', $query);
        }

        $filmes = $builder->findAll();
---
SELECT *
FROM `filme`

    public function excluir($id)
    {
        if ($this->filmeModel->delete($id)) {
---
DELETE FROM `filme`
WHERE `id` IN ('8')

    public function recomendacoes()
    {
        $filmes = $this->filmeModel
            ->select('generos')
            ->where('nota >=', 7.0)
            ->findAll();

        $generoCount = [];

        foreach ($filmes as $f) {
            if (!empty($f['generos'])) {
                $generos = explode(',', $f['generos']);
                foreach ($generos as $genero) {
                    $genero = trim($genero);
                    $generoCount[$genero] = ($generoCount[$genero] ?? 0) + 1;
                }
            }
        }

        arsort($generoCount);
        $generosFavoritos = array_keys(array_slice($generoCount, 0, 3));

        $recomendacoes = [];
        foreach ($generosFavoritos as $genero) {
            $filme = $this->buscarFilmePorGenero($genero);
            if ($filme) {
                $recomendacoes[] = $filme;
            }
        }

        $totalMinutos = $this->filmeModel
            ->selectSum('duracao')
            ->where('status', 'assistido')
            ->first()['duracao'];
---
SELECT `generos`
FROM `filme`
WHERE `nota` >= 7
SELECT SUM(`duracao`) AS `duracao`
FROM `filme`
WHERE `status` = 'assistido'
 LIMIT 1