app/Controllers/Filme.php

    public function index($statusAtual = null){
        $termoBusca = $this->request->getGet('q');
        $consulta = $this->filmeModel;

        if ($statusAtual) {
            $consulta = $consulta->where('status', $statusAtual);
        }

        if ($termoBusca) {
            $consulta = $consulta->like('filme', $termoBusca);
        }

        $listaFilmes = $consulta->findAll();
---
SELECT *
FROM `filme`

    public function recomendacoes(){
        $filmesBemAvaliados = $this->filmeModel
            ->select('generos')
            ->where('nota >=', 7.0)
            ->findAll();

        $contagemGeneros = [];

        foreach ($filmesBemAvaliados as $filme) {
            if (!empty($filme['generos'])) {
                $generos = explode(',', $filme['generos']);
                foreach ($generos as $genero) {
                    $genero = trim($genero);
                    $contagemGeneros[$genero] = ($contagemGeneros[$genero] ?? 0) + 1;
                }
            }
        }

        arsort($contagemGeneros);
        $generosFavoritos = array_keys(array_slice($contagemGeneros, 0, 3));

        $listaRecomendacoes = [];
        foreach ($generosFavoritos as $genero) {
            $filmeRecomendado = $this->buscarFilmePorGenero($genero);
            if ($filmeRecomendado) {
                $listaRecomendacoes[] = $filmeRecomendado;
            }
        }

        $totalMinutosAssistidos = $this->filmeModel
            ->selectSum('duracao')
            ->where('status', 'assistido')
            ->first()['duracao'];
---
SELECT `generos`
FROM `filme`
WHERE `nota` >= 7
SELECT SUM(`duracao`) AS `duracao`
FROM `filme`
WHERE `status` = 'assistido'
 LIMIT 1

    public function view($idFilme)
    {
        $filme = $this->filmeModel->find($idFilme);
---
SELECT *
FROM `filme`
WHERE `filme` LIKE '%Frozen%' ESCAPE '!'