app/Controllers/Filme.php

    public function recomendacoes()
    {
        $filmes = $this->filmeModel // seleciona todos os filmes com a nota maior igual a 7 e pega a coluna generos
            ->select('generos')
            ->where('nota >=', 7.0)
            ->findAll();

        $generoCount = [];

        foreach ($filmes as $f) { // conta quantos generos tem cada filme bem avaliado
            if (!empty($f['generos'])) {
                $generos = explode(',', $f['generos']); // explode(',', $f['generos']) → transforma a string de gêneros separada por vírgula em um array
                foreach ($generos as $genero) {
                    $genero = trim($genero); //remove espaços antes ou depois.
                    $generoCount[$genero] = ($generoCount[$genero] ?? 0) + 1; // se o gênero ainda não existir no array $generoCount, inicializa com 0, depois soma 1.
                }
            }
        }

        arsort($generoCount); //em ordem decrescente de frequência, mantendo as chaves (os nomes dos gêneros).
        $generosFavoritos = array_keys/*retorna apenas o nome*/(array_slice($generoCount, 0, 3));
        //ordena os generos e seleciona os 3 mais bem avaliados
        $recomendacoes = [];
        foreach ($generosFavoritos as $genero) {
            $filme = $this->buscarFilmePorGenero($genero); // busca um filme daquele genero
            if ($filme) {
                $recomendacoes[] = $filme;
            }
        }

        $totalMinutos = $this->filmeModel
            ->selectSum('duracao')
            ->where('status', 'assistido')
            ->first()['duracao'];
---
SELECT `generos`
FROM `filme`
WHERE `nota` >= 7
SELECT SUM(`duracao`) AS `duracao`
FROM `filme`
WHERE `status` = 'assistido'
 LIMIT 1

    public function view($id)
    {
        $filme = $this->filmeModel->find($id);
---
SELECT *
FROM `filme`
WHERE `filme`.`id` = '11'