app/Controllers/Producao.php

public function index($status = null)
{
    $query = $this->request->getGet('q');

    $builder = $this->producaoModel;

    if ($status) {
        $builder = $builder->where('status', $status);
    }

    if ($query) {
        $builder = $builder->like('filme', $query);
    }

    $producoes = $builder->findAll();
---
SELECT *
FROM `filmes`
WHERE `status` = 'em andamento'
SELECT *
FROM `producao`

public function view($id)
{
    $producao = $this->producaoModel->find($id);
---
SELECT *
FROM `producao`
WHERE `producao`.`id` = '12'