app/Controllers/Producao.php

    public function store(){
    $postData = $this->request->getPost();

    // Buscar dados adicionais da OMDb
    $apiData = $this->fetchMovieData($postData['filme']);

    if ($apiData) {
        $postData = array_merge($postData, $apiData);
    }

    if ($this->producaoModel->save($postData)){
---
INSERT INTO `producao` (`filme`, `nota`, `comentario`, `status`, `duracao`, `diretor`, `elenco`, `sinopse`, `poster`) VALUES ('Titanic', '8', 'Um clássico', 'assistido', '194', 'James Cameron', 'Leonardo DiCaprio, Kate Winslet, Billy Zane', '84 years later, a 100 year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.', 'https://m.media-amazon.com/images/M/MV5BYzYyN2FiZmUtYWYzMy00MzViLWJkZTMtOGY1ZjgzNWMwN2YxXkEyXkFqcGc@._V1_SX300.jpg')